In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df = pd.read_csv('../data/yob_ss/yob1880.txt', header=None,
                names = ['first', 'sex', 'count'])
print(df.shape)
df.head()

(2000, 4)

       first sex  count  year
0       Mary   F   7065   NaN
1       Anna   F   2604   NaN
2       Emma   F   2003   NaN
3  Elizabeth   F   1939   NaN
4     Minnie   F   1746   NaN

In [34]:
#I'll take careof his tomorrow, but it dawned on me to make name comparisons a bit more adjusted for population growth we should
#do count/year percentage... Pragmatically keep them genders seperate though.

In [35]:
#Hmm, but we have a gazillion... I see two approaches:
#Make a giant data frame and add all those guys to it, seperating them via year.

#2 Have a gazillion dataframes thenmaybe add as needed.

#Yeah, we're doing the former

birth_years = []

for specific_year in range(1880, 2023):
    curr_df = pd.read_csv(f'../data/yob_ss/yob{specific_year}.txt', header=None,
                names = ['first', 'sex', 'count'])
    curr_df['year'] = specific_year
    birth_years.append(curr_df)
    
df = pd.concat(birth_years, axis=0, ignore_index=True) #Apparently it's faster to do it this way. More intuitive to be to
#update the 'final' df immediately, but at least upon asking ChatGPT they claim it's quicker this way. Although we only have
#4 features, including year, we do have over 2m records.
    
print(df.shape)
df.head()

(2085537, 4)

       first sex  count  year
0       Mary   F   7065  1880
1       Anna   F   2604  1880
2       Emma   F   2003  1880
3  Elizabeth   F   1939  1880
4     Minnie   F   1746  1880

Hmm, I'm wondering if SQL might have been the way to go for this. Eh, oh well.

In [33]:
df[(df['sex'] == 'M') & (df['year'] < 1900)].sort_values('count', ascending=False)[:10]

         first sex  count  year
942       John   M   9655  1880
4962      John   M   9557  1882
943    William   M   9532  1880
9317      John   M   9388  1884
4963   William   M   9298  1882
18975     John   M   9247  1888
29758     John   M   9039  1892
14018     John   M   9026  1886
9318   William   M   8897  1884
7115      John   M   8894  1883

In [36]:
df['sex'].value_counts() #Wow.... and who said it's 50/50?!!?!? Not even close.... perhaps in one year is different
#Oh no noob - this refers to just names... we'd need to sum the counts...

#Still interesting though... albeit many are duplicated

sex
F    1228026
M     857511
Name: count, dtype: int64

In [38]:
df[df['year'] == 1880]['sex'].value_counts()

sex
M    1058
F     942
Name: count, dtype: int64